<img style="float: left;;" src='../Figures/iteso.jpg' width="50" height="100"/></a>

# <center> <font color= #000047> Repaso de la Librería Pandas</font> </center>

# Entrada y salida de datos


<div class="alert alert-info"><strong>NOTA:</strong> 
Por lo general, solo leeremos archivos csv directamente o usaremos pandas-datareader para extraer datos de la web. Este apartado es una descripción general y rápida de lo que es posible realizar con la librería de pandas (no trabajaremos con archivos SQL en este curso)</div>


La librería de pandas permite leer una variedad de tipos de archivos usando sus métodos pd.read_. Echemos un vistazo a los tipos de datos más comunes:

In [1]:
import pandas as pd 
import numpy as np

## CSV
Los archivos de valores separados por comas (CSV), son archivos de texto que utilizan comas como delimitadores de campo.<br>
### CSV entrada

In [2]:
df = pd.read_csv('../Data/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      int64
 1   b       4 non-null      int64
 2   c       4 non-null      int64
 3   d       4 non-null      int64
dtypes: int64(4)
memory usage: 256.0 bytes

In [4]:
df.describe()

               a          b          c          d
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [5]:
df['ab'] = df['a']*df['b']

In [6]:
df

    a   b   c   d   ab
0   0   1   2   3    0
1   4   5   6   7   20
2   8   9  10  11   72
3  12  13  14  15  156

### CSV salida

In [7]:
df.to_csv('../Data/example_csv2ab.csv')

## Excel
con Pandas podemos leer y escribir archivos de MS Excel. Sin embargo, esto solo importa datos, no fórmulas ni imágenes. Un archivo que contiene imágenes o macros puede causar que el método <tt>.read_excel()</tt> no funcione.

### Excel entrada

In [8]:
df_excel = pd.read_excel('../Data/Excel_sample.xlsx')
df_excel

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
del df_excel['Unnamed: 0']

In [10]:
df_excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df_excel = pd.read_excel('../Data/Excel_sample.xlsx', index_col=0)
df_excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df_excel['a_b'] = df_excel['a'] + df_excel['b']
df_excel

    a   b   c   d  a_b
0   0   1   2   3    1
1   4   5   6   7    9
2   8   9  10  11   17
3  12  13  14  15   25

### Excel salida

In [13]:
df_excel.to_excel('../Data/excel_a_b.xlsx')

____